src/Catalogs/ДоговорныеПозиции/ДоговорныеПозиции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорныеПозиции</name>
  <owners>Catalog.Договоры</owners>
  <attributes>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ДоговорныеПозиции/ДоговорныеПозиции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговорныеПозиции</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОстатокПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорнаяПозиция</name>
    <type>
      <types>CatalogRef.ДоговорныеПозиции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ДоговорныеПозиции/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(ВыбДата,МПЗ,Валюта,Количество,Цена)
ДП = Справочники.ДоговорныеПозиции.ПустаяСсылка();
	Попытка
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорныеПозиции.Ссылка
		|ИЗ
		|	Справочник.ДоговорныеПозиции КАК ДоговорныеПозиции
		|ГДЕ
		|	ДоговорныеПозиции.Владелец = &Владелец
		|	И ДоговорныеПозиции.МПЗ = &МПЗ";
	Запрос.УстановитьПараметр("Владелец", ВладелецДП);
	Запрос.УстановитьПараметр("МПЗ", МПЗ);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДП = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
			Если ДП.Пустая() Тогда
			ДП = Справочники.ДоговорныеПозиции.СоздатьЭлемент();
			ДП.Владелец = ВладелецДП;
			ДП.МПЗ = МПЗ;
			ДП.Записать();
			КонецЕсли; 
	ДоговорныеПозиции = РегистрыСведений.ДоговорныеПозиции.СоздатьМенеджерЗаписи();
	ДоговорныеПозиции.Период = ВыбДата;
	ДоговорныеПозиции.ДоговорнаяПозиция = ДП.Ссылка;
	ДоговорныеПозиции.Количество = Количество;
	ДоговорныеПозиции.Цена = Цена;
	ДоговорныеПозиции.Валюта = Валюта;
	ДоговорныеПозиции.Записать(Истина);
	Исключение
	Сообщить("МПЗ "+СокрЛП(МПЗ.Наименование)+":");
	Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьВалюту(Наименование)	
Возврат(Справочники.Валюты.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаСервере
Функция ПолучитьМПЗ(Наименование)	
Возврат(Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
ВыбДата = ТекущаяДата();
	Если ВвестиДату(ВыбДата,"Введите дату записи периодических реквизитов",ЧастиДаты.Дата) Тогда
	Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c договорными позициями");
		Если Результат <> Неопределено Тогда
		ExcelЛист = Результат.ExcelЛист;
		КолСтрок = Результат.КоличествоСтрок; 
		    Для к = 2 по КолСтрок Цикл
			Состояние("Обработка...",к*100/КолСтрок,"Загрузка договорных позиций..."); 
			Наименование = СокрЛП(ExcelЛист.Cells(к, 1).Value);
			Наименование = СтрЗаменить(Наименование,"?","±");
			Количество = Число(ExcelЛист.Cells(к, 2).Value);
			Цена = Число(ExcelЛист.Cells(к, 3).Value);
			Валюта = ПолучитьВалюту(СокрЛП(ExcelЛист.Cells(к, 4).Value));
				Если Не Валюта.Пустая() Тогда
				МПЗ = ПолучитьМПЗ(Наименование);
					Если Не МПЗ.Пустая() Тогда
					ЗагрузитьИзФайлаНаСервере(ВыбДата,МПЗ,Валюта,Количество,Цена);
					Иначе	
					Сообщить("МПЗ "+Наименование+" не найдена");
					КонецЕсли; 
				Иначе
				Сообщить("Валюта "+СокрЛП(ExcelЛист.Cells(к, 4).Value)+" не найдена");						
				КонецЕсли; 
		    КонецЦикла;
		Результат.Excel.Quit();		
		Элементы.Список.Обновить();
		КонецЕсли;	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ВладелецДП = Параметры.Отбор.Владелец;
КонецПроцедуры

&НаСервере
Процедура ПодборМПЗНаСервере(ТаблицаМПЗ)
	Для каждого ТЧ_МПЗ Из ТаблицаМПЗ Цикл
	ДП = Справочники.ДоговорныеПозиции.СоздатьЭлемент();
	ДП.Владелец = ВладелецДП;
	ДП.МПЗ = ТЧ_МПЗ.МПЗ;
	ДП.Записать();
	ДоговорныеПозиции = РегистрыСведений.ДоговорныеПозиции.СоздатьМенеджерЗаписи();
	ДоговорныеПозиции.Период = ТекущаяДата();
	ДоговорныеПозиции.ДоговорнаяПозиция = ДП.Ссылка;
	ДоговорныеПозиции.Количество = ТЧ_МПЗ.Количество;
	//ДоговорныеПозиции.Цена = Цена;
	//ДоговорныеПозиции.ДатаНачалаПоставки = ВыдДатаНачалаПоставки;
	ДоговорныеПозиции.Записать(Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодборМПЗ(Команда)
ТаблицаМПЗ = ОткрытьФормуМодально("ОбщаяФорма.ПодборМПЗ", Новый Структура("МестоХранения",Неопределено));
	Если ТаблицаМПЗ <> Неопределено Тогда
		Если ТаблицаМПЗ.Количество() > 0 Тогда
		ПодборМПЗНаСервере(ТаблицаМПЗ);
		Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры
